---
kind: other
id: Properties.T:Autodesk.Revit.DB.Viewport
source: html/71bf8e09-95f2-595f-ff19-7726800f0069.htm
---
# Viewport Properties

The id of the assembly instance to which the element belongs.